tap "nikitabobko/tap"

# Dotfile/bootstrap tooling
brew "age"
brew "bitwarden-cli"
brew "chezmoi"
brew "git"

# Terminal stack
brew "fd"
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "zoxide"

# Neovim/LSP/build helpers
brew "cmake"
brew "go"
brew "llvm"
brew "node"
brew "python@3.14"
brew "tree-sitter@0.25"
brew "zig"

# Daily developer tools
brew "gh"
brew "pandoc"

# GUI apps used by the managed config
cask "aerospace"
cask "bitwarden"
cask "kitty"
cask "obsidian"
cask "font-jetbrains-mono-nerd-font"
