tap "nikitabobko/tap"

# Dotfile/bootstrap tooling
brew "age"
brew "bitwarden-cli"
brew "chezmoi"
brew "git"

# Terminal and shell workflow
brew "ccache"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "zoxide"

# Neovim/LSP/build helpers
brew "cmake"
brew "eigen"
brew "go"
brew "graphviz"
brew "hlint"
brew "llvm"
brew "ninja"
brew "node"
brew "python@3.14"
brew "tree-sitter@0.25"
brew "zig"

# Document/media/security utilities
brew "gh"
brew "john-jumbo"
brew "pandoc"
brew "pdfcrack"
brew "portaudio"
brew "qpdf"
brew "qrencode"
brew "telnet"

# Window manager and terminal apps
cask "aerospace"
cask "alt-tab"
cask "ghostty"
cask "kitty"
cask "warp"
cask "font-jetbrains-mono-nerd-font"

# Security/network/system utilities
cask "bitwarden"
cask "clash-verge-rev"
cask "docker-desktop"
cask "stats"
cask "the-unarchiver"
cask "wireshark-app"

# Daily GUI apps
cask "anaconda"
cask "codex"
cask "dingtalk"
cask "discord"
cask "mactex"
cask "notion"
cask "obsidian"
cask "qq"
cask "sketch"
cask "snipaste"
cask "xmind"
